Revit.GeometryConversion.HermiteToNurbs.ConvertExact(Autodesk.Revit.DB.HermiteSpline)
Convert a Revit HermiteSpline exactly to a NurbsCurve equivalent
crv:
Returns:

Revit.GeometryConversion.HermiteToNurbs.Clamp(System.Collections.Generic.IEnumerable{System.Double},System.Int32)
Clamp a collection of curve parameters by introducing knot multiplicities at each end such
that each end of the knot vector has degree + 1 copies of the knot
curveParameters:
degree:
Returns:

Revit.GeometryConversion.HermiteToNurbs.GetNurbsPoints(Autodesk.Revit.DB.HermiteSpline,System.Double[])
Obtain the Nurbs control points from a Hermite Spline
curve:
nurbsKnots:
Returns: